[
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "You'll start the practice in child's pose sending focus and awareness to your breath - on every inhale Nicole encourages you to take in positive energy and on every exhale let go of anything that no longer serves you.",
        "additional_information": "Although the yoga routine is suitable for all levels of practice, if you have an existing injury or health condition we recommend consulting your physician before starting any new exercise program.\nIf you're ready to move, here's how you can Watch Move With Nicole's 30-minute yoga routine:\n\nOpen your heart and maintain a healthy spine with this 30-minute yoga workout flow Nicole says. \"You'll start the practice in child's pose sending focus and awareness to your breath - on every inhale Nicole encourages you to take in positive energy and on every exhale let go of anything that no longer serves you.\"\n\nStarting any yoga practice with a gentle breathing exercise like this can help bring your attention to your body and be more present while kickstarting the shift from the sympathetic nervous system - your engaged 'fight-or-flight' state - to the parasympathetic nervous system which is your calm, repair and relaxed state. Research has shown that regularly performing breathing exercises or building meditation into your routine can improve feelings of anxiety and stress and increase mind-body awareness.\n\nWe love that Nicole moves elegantly and gracefully along the mat rippling through a series of popular yoga poses designed to build mobile shoulders and hips while stretching tight muscle groups like the hamstrings, back, chest and shoulders. Unlike faster-paced vinyasa or Rocket styles of yoga practice, this flow class slows things down so that you can move into each muscle group with care and attention.\n\nYoga benefits are abundant; regular practice engages the whole body including all the major muscle groups and some styles of yoga can build muscle, strengthen bones and ligaments, improve core stability and strength and boost balance, coordination and overall stability. For many people 30 minutes of yoga is enough to improve their mood and reduce stress, but bear in mind that consistency is what breeds results in the long term. So we recommend adding yoga into your exercise routine more regularly - even once a week - to reap the benefits.\n\nIf you're keen to learn what a regular yoga practice could look like, our fitness writer did yoga every day for a month for the first time in 10 years which can help yoga beginners understand what to expect. We love the attention to the lower back and spine throughout, but don't worry if you don't look like Nicole during any of these postures - flexibility takes months to develop so give each posture a go and take rest where you need it. For example, if you can't touch your toes you might have tight hamstrings so softly bend your knees to provide more space during forward folds and ease yourself gently into backbends to protect your lower back. During the core exercises toward the end, focus on lengthening your spine and sitting tall, breathing as you move. Brace your stomach and imagine someone pulling a string from the crown of your head to help you stay tall without hunching your shoulders.\n\nThe only exercise we don't recommend for beginners is the wheel pose, one of the last postures of the session. Nicole first guides you into glute bridges so if you don't have experience with wheels or have a tight back we recommend sticking to bridges to begin with, which are a popular wheel-prep exercise. But most importantly be kind to yourself during this short yoga routine and don't punish yourself if you struggle with any poses - yoga is less about the ego and more about feeling good within your body.",
        "workout_title": "30-minute Yoga Flow with Nicole",
        "url": "https://www.tomsguide.com/wellness/fitness/forget-weights-this-30-minute-yoga-routine-builds-flexibility-and-strengthens-your-core"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "Hold each of the 5 poses for 60 seconds before moving on to the next\n\n**Childs Pose**\nAn awesome way to start a yoga practice - especially first thing in the morning - Childs Pose allows you to reconnect with your breath and provides a gentle release for your lower back and hips\nMuscles worked\n- lats\n- low back\n- hips\nTo do this\n- Get on all fours on your mat\n- Spread your knees wide and position your big toes so that theyre touching\n- Let your stomach fall between your thighs and allow your forehead to drop toward the floor\n- Extend your arms in front of your body with your palms on the floor\n- Breathe deeply in and out here\n\n**Happy Baby**\nStretch your lower back and hips in a more direct way with this position\nMuscles worked\n- hips\n- inner thighs\n- low back\nTo do this\n- Lie on your back on your mat\n- Bend your knees and bring them to your stomach gripping the outsides of your feet. Flex your heels and ankles\n- Breathe here focusing on keeping your ankles directly above your knees while pushing against your hands with your feet\n\n**Cat-Cow**\nStart to warm your body up to movement with Cat-Cow which stretches your spine engages the core and opens the chest\nMuscles worked\n- erector spinae\n- serratus anterior\n- abdominals\nTo do this\n- Get on all fours on your mat with yours hands under yours shoulders and knees under your hips\n- Engage your abs exhale and push your spine up toward the ceiling\n- Allow your head to fall toward your chest. Hold here for 10 seconds\n- Inhale and let your spine fall back down allowing your stomach to fall toward the ground while your head comes up and back. Hold here for 10 seconds\n\n**Cobra**\nNot only does Cobra Pose stretch your shoulders chest and abs it strengthens your arms and butt\nMuscles worked\n- lats\n- triceps\n- abdominals\n- glutes\n- hamstrings\nTo do this\n- Lie on your mat on your stomach with your legs shoulder-width apart and the tops of your feet on the mat\n- Place your hands underneath your shoulders with your elbows tucked into your body\n- Inhale and begin to straighten your arms pushing through the tops of your feet\n- Lift your chest off the floor and push your shoulders back\n- Stop straightening your arms as soon as your pelvis loses contact with the ground - breathe in and out here for up to 30 seconds\n\n**Chair**\nStrengthen your legs back and shoulders with Chair Pose This move will also challenge your balance\nMuscles worked\n- abdominals\n- erector spinae\n- quads\n- hamstrings\n- gluteus medius\n- delts\n- triceps\nTo do this\n- Stand with your feet together and inhale extending your arms directly overhead\n- Exhale begin to sit back into your hips and bend your knees. Stop when your thighs are parallel to the ground\n- Roll your shoulders down and back and press your tailbone toward the ground. Breathe here",
        "additional_information": "This workout is intended to be 5 minutes long. It is a beginner yoga routine.",
        "workout_title": "Beginner Yoga Routine",
        "url": "https://www.healthline.com/health/fitness-exercise/morning-yoga-routine"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "Hold each pose below for 1 minute and make your way through the circuit twice.\n\n**Downward Dog**\nA yoga classic Downward Dog stretches the shoulders hamstrings calves and feet while strengthening your arms and legs\nMuscles worked\n- quadriceps\n- abdominals\n- deltoids\nTo do this\n- Get on all fours on your mat with your hands underneath your shoulders and your knees underneath your hips. Inhale\n- Exhale and lift your knees away from the floor pushing your heels down toward the floor. Lift your tailbone toward the ceiling. Do not lock your knees\n- Draw your shoulder blades toward your tailbone and keep your head between your arms\n- Stay here working on getting your feet in contact with the ground\n\n**Warrior I**\nStrengthen your legs and open your hips and chest with Warrior I pose\nMuscles worked\n- abdominals\n- hamstrings\n- quads\nTo do this\n- Stand with your feet together and arms at your side\n- Step with your left foot into a lunge keeping your right leg straight and turning your right foot at a 45-degree angle\n- Extend your arms above your head\n- Squeeze your shoulder blades together and down and lift your head to look up at your fingertips\n\n**Bridge**\nStrengthen your posterior chain - or the backside of your body - with a Bridge\nMuscles worked\n- hamstrings\n- glutes\n- quads\nTo do this\n- Lie on your back with your knees bent and feet flat on the ground\n- Place your arms at your sides with your palms on the ground\n- Inhale. Exhale and push up through your feet pushing your hips up toward the sky\n\n**Garland**\nOpen your hips thighs and ankles with Garland Pose\nMuscles worked\n- deltoids\n- abdominals\nTo do this\n- Squat down with your feet as close together as you can get them toes pointed out\n- Let your torso fall between your thighs pressing your elbows against your knees\n- Keep your tailbone pressed toward the ground and your chest up using the resistance of your knees to help you\n\n**Bow**\nStretch the entire front side of your body while strengthening your back in this pose\nMuscles worked\n- lats\n- triceps\n- glutes\n- hamstrings\nTo do this\n- Lay on your stomach with your arms extended by your sides and your palms up\n- Bend your knees and reach back grabbing hold of your ankles with your hands\n- Keep your knees in line with your hips\n- As you inhale lift your heels away from your butt while you lift your thighs off the ground\n- Press your shoulder blades back and look forward\n\n**Boat**\nYour abs will eventually thank you for Boat Pose\nMuscles worked\n- abdominals\n- hip flexors\nTo do this\n- Sit on your butt with your legs extended in front of you\n- Lean back slightly with your hands on the ground supporting you\n- Inhale and bring your knees toward your chest stopping when your thighs are at a 45-degree angle to the ground\n- Extend your legs if possible - otherwise keep them here\n- Bring your arms out in front of you so theyre parallel to the floor. Hold here",
        "additional_information": "This is an intermediate yoga routine. You should complete 2 circuits of the 6 poses, holding each for 1 minute. If you have time, warm up with several poses from the beginner routine.",
        "workout_title": "Intermediate Yoga Routine",
        "url": "https://www.healthline.com/health/fitness-exercise/morning-yoga-routine"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "Warm up with the beginner or intermediate routine then move into this sequence. Hold each pose for a 1-minute period and repeat the circuit twice.\n\n**King Pigeon**\nOpen your hips and stretch your abdominals with King Pigeon a progression of Pigeon Pose\nMuscles worked\n- triceps\n- biceps\n- lats\nTo do this\n- Assume Pigeon Pose with your left knee bent in front of you and your right leg extended behind you\n- Bend your right knee and bring your foot up toward your back\n- Arch your back and drop your head down\n- Reach your hands over your head and grab hold of your foot with both hands\n\n**Dove**\nStretch your back and abs - plus strengthen your shoulders and legs - with Dove Pose\nMuscles worked\n- deltoids\n- quads\n- hamstrings\n- glutes\nTo do this\n- Kneel on the floor with your arms down at your sides\n- With your fingers facing forward lean back onto your hands with your arms straight\n- Lower down onto your forearms\n- Begin to push your thighs up and out arching your back dropping your head and moving your hands as close to your feet as possible\n\n**Peacock**\nWork on your arm strength and balance with Peacock Pose\nMuscles worked\n- forearms\n- abdominals\n- lats\n- low back\n- glutes\n- hamstrings\nTo do this\n- Kneel on the floor with your knees wide and sit on your heels\n- Lean forward and place your palms on the floor with your fingers facing back toward your body\n- Bend your elbows and slide your knees to the outside of your arms\n- Lean your torso onto your upper arms and lower your head\n- Straighten your knees and extend your legs behind you starting first with the tops of your feet on the floor\n- When you feel stable here shift your weight forward and lift your legs off the ground\n\n**Lord of the Dance**\nImprove your balance and flexibility and stretch the whole front side of your body with Lord of the Dance\nMuscles worked\n- quads\n- hamstrings\n- abdominals\n- lats\nTo do this\n- Stand with your feet together and arms down at your sides\n- Bend your left knee bringing your foot to your butt\n- Grab the outside of your foot with your left hand pushing your tailbone down and your pelvis up toward your belly button\n- Allow your knee to extend slightly as it moves up toward the ceiling\n- Extend your right arm in front of you parallel to the floor\n\n**Headstand**\nBuild upper body and core strength as well as improve your balance and even circulation with a Headstand\nMuscles worked\n- triceps\n- lats\n- abdominals\n- quads\n- hamstrings\nTo do this\n- Get onto all fours with your wrists under your shoulders and your knees under your hips\n- Bring your forearms to the floor clasping your hands and placing the top of your head on the floor right in front of your hands\n- Straighten your legs and walk them into the Downward Dog position. Aim to get your hips as close as possible to shoulder level\n- Inhale and lift one leg up toward the ceiling then follow with the other\n\n**Headstand Lotus**\nA progression on a traditional Headstand youll challenge your balance even more with the Lotus variation\nMuscles worked\n- triceps\n- lats\n- abdominals\n- quads\n- hamstrings\nTo do this\n- Assume a Headstand position\n- Interlock your legs by bending your right leg and placing it on your left thigh\n- Follow by bending your left leg and placing it on your right thigh\n\n**Firefly**\nStretch your hamstrings and hips and get yourself a killer set of arm muscles with Firefly Pose\nMuscles worked\n- deltoids\n- lats\n- triceps\n- chest\n- abdominals\nTo do this\n- Squat down and lean your torso forward between your legs\n- Place your hands on the floor inside your legs\n- Bring your upper arms as close to your upper thigh as possible\n- Begin to lift yourself off the floor and push your weight into your hands\n- Shift your center of gravity back allowing your legs to straighten in front of you",
        "additional_information": "This is an advanced yoga routine. Complete 2 circuits of these 7 poses, holding each for 1 minute. Warm up with the beginner or intermediate routine before starting.",
        "workout_title": "Advanced Yoga Routine",
        "url": "https://www.healthline.com/health/fitness-exercise/morning-yoga-routine"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "Warm-up:\n* Cat-Cow: 5 slow breaths (about 1 minute)\n* Downward-Facing Dog: 5 slow breaths\n* Side Bends: 3 rounds on each side\n* Chair Pose: 5 breaths\n\nVinyasa Sequence (repeat on both sides):\n* Interlaced Forward Fold: 3 long breaths\n* Low Lunge Twist: 3 breaths\n* Warrior II: 3-5 breaths\n* Wide Forward Fold: 3-5 breaths\n* Fallen Triangle: 5 breaths\n* Lizard Pose: 5-8 deep breaths\n* Low Plank: Hold briefly and flow into Up Dog\n* Up Dog: 1 breath\n\nCool-down:\n* Airplane: 5-8 breaths\n* Bridge: 3-5 breaths (repeat 3 times)\n* Happy Baby: 5-8 breaths\n* Savasana: 1-2 minutes",
        "additional_information": "* Time: 15 minutes\n* Equipment: Mat\n* Flow from pose to pose, holding and breathing as noted.\n* After completing poses five through twelve on the right side, repeat on the left before moving on.\n* Make this practice about moving intuitively. If you want to feel serene throughout the day, keep your movement slow and gentle. If you want to feel energized, build up to a quicker, more heated pace as you progress.\n* Detailed instructions on how to perform each pose are provided in the text.",
        "workout_title": "15-Minute Morning Yoga Routine",
        "url": "https://www.womenshealthmag.com/fitness/g32393284/morning-yoga-routine/"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "1. **Mountain pose:** 60 seconds\n    * Stand up tall with your feet together and distribute your weight equally between both feet. Keep your spine long, your body soft, and bring your palms together in front of the heart.\n2. **Upward salute pose:** 30 seconds\n    * Inhale, turn your palms out, and bring your arms up and overhead. Expand the chest, look up, and maintain your neck and head relaxed. Bring your palms together, lengthen the spine, and stretch your shoulders and belly.\n3. **Standing forward bend pose:** 30 seconds\n    * Exhale slowly as you bend from the hip joints, draw your belly slightly in and lengthen your torso.\n4. **Downward facing dog pose:** 60 seconds\n    * Walk your hands to the front and lift your hips up and back.\n5. **Plank pose:** 30 seconds\n    * Exhale as you step your legs back and straighten the spine.\n6. **Cobra pose:** 30 seconds\n    * Lie on your belly and as you inhale straighten your arms and lift your chest off the floor.\n7. **Downward facing dog pose:** 60 seconds\n    * Extend your arms and legs and lift your hips up and back.\n8. **High lunge pose:** 30 seconds\n    * Exhale as you step your left leg to the front, bend your knee and lay your torso on the left thigh.\n9. **Warrior I pose:** 30 seconds\n    * Lift your torso and rotate your right foot out to a 90-degree angle. Bring your arms up and overhead with the palms facing inward.\n10. **Warrior II pose:** 30 seconds\n    * Rotate your torso to the right, bring the arms up to shoulder height and keep them parallel to the floor.\n11. **Extended triangle pose:** 30 seconds\n    * Straighten your left leg and exhale as you bring your left hand to the floor on the inside or outside of the left foot. Reach the right arm toward the ceiling and gaze at your right thumb.\n12. **Tree pose:** 30 seconds\n    * Go into mountain pose, transfer your weight to the right foot, bend your left knee and place the sole of your left foot against the inner right thigh. Inhale as you raise your arms above your head and press your hands together. \n13. **Bound angle pose:** 30 seconds\n    * Sit up, bend your knees, press the soles of your feet together and drop your knees out to the sides.\n14. **Bridge pose:** 30 seconds\n    * Lie on your back, bend both knees and place your feet flat on the floor. Clasp the hands below your pelvis and inhale as you lift the hips and chest up.\n15. **Knees to chest pose:** 60 seconds\n    * Lower the hips and chest back to the floor and pull both knees up toward your chest.",
        "additional_information": "Repeat this flow 2 times, once on each side.",
        "workout_title": "Active Recovery Yoga Essential Flow",
        "url": "https://www.spotebi.com/yoga-sequences/active-recovery-flow/"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "1. **Cat-Cow:**\n    - Start on all fours with your hands below shoulders and knees below hips.\n    - Slowly round your back up toward the ceiling like a cat while tucking your chin toward your tailbone.\n    - Then reverse the movement by arching your back (think about a cow) while lifting your hips and head.\n    - Form tip: Focus on raising your head and tailbone to get into the cow position rather than dumping into your lower back.\n    - Alternate between cat and cow for one minute or for a slow 10 reps (five with back rounded, five with back arched).\n2. **Supported Side Plank:**\n    - Lie on your left side with your legs extended and hips stacked.\n    - Prop your upper body up on your left elbow and forearm. Your left elbow should be bent 90 degrees and be positioned directly under your shoulder.\n    - Brace your core by contracting your abs forcefully as if you were about to be punched in the gut.\n    - Raise your hips until your body forms a straight line from your ankles to your shoulders.\n    - Hold this position for five breaths or as long as you can.\n    - Switch sides so that you’re lying on your right side and repeat.\n3. **Downward Dog Facing a Chair:**\n    - Stand facing a sturdy chair about arm’s length away with your feet hip- to shoulder-width apart. You can place the chair so the seat is facing you (as shown) or so the back of the chair is facing you.\n    - Hinging from your hips, take a few steps back so that your spine becomes parallel with the floor (or as far as you comfortably can).\n    - Hold for five to 10 deep breaths, or as long as you can.\n    - Bend your knees and take baby steps toward the chair, rounding your back slightly as you return to standing.\n4. **Plank:**\n    - Lie on your stomach with your elbows directly underneath your shoulders and forearms flat on the floor. Focus your eyes between your hands. You can also do the move with your knees on the floor.\n    - From here, lift your hips toward the ceiling until your body forms a straight line from head to ankles. If you’re keeping your knees on the floor, lift your hips so your body forms a straight line from head to knees.\n    - Hold for five to 10 deep breaths, or as long as you can with good form.\n5. **Seated Crescent Lunge:**\n    - Sit toward the edge of a sturdy chair that does not have arm rests.\n    - Turn your body to the left so that your left leg is forward and your right leg is behind you.\n    - Place your left foot flat on the floor. Your left thigh will be on the chair.\n    - Extend your right leg behind you. It’s OK to bend the knee, but try to have the ball of your right foot touch the floor.\n    - Press both feet into the ground so you feel a squeeze in your leg muscles . \n    - Brace your core, engaging the muscles around your belly button.\n    - Roll your shoulders down and squeeze your shoulder blades in.\n    - Keep your hands on your waist or raise them above your head as far as you comfortably can.\n    - Keep your head neutral and gaze forward.\n    - Hold for five to 10 deep breaths, or as long as you can.\n    - Return to start and repeat on the other side.\n6. **Warrior II:**\n    - Begin in a staggered stance with your left foot forward and right foot back.\n    - Turn your left toes out so they’re pointing straight ahead.\n    - Bend your left knee about 90 degrees, keeping your knee above your ankle and heel.\n    - Keep the outer edge of your right (back) foot firmly on the floor. Engage your belly.\n    - Extend your arms out at your sides with your palms facing down, and gaze out over the middle fingertips of your left hand.\n    - Breathe here for three to five slow, deep breaths, then\n    - Gently return to the starting position.\n    - Repeat on the other side.",
        "additional_information": "This yoga routine can help you gain strength, endurance, and balance. Aim to do this routine 2-3 times per week. You can modify the routine by spending only a few seconds in each pose but repeating the entire sequence three times.",
        "workout_title": "Quick Yoga Strength Workout",
        "url": "https://www.silversneakers.com/blog/yoga-strength-workout/"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "**Warm-up**\n* Cat-cow: Start on all fours. Inhale, dropping your belly and lifting your tailbone (cow pose). Exhale, rounding your spine and looking towards your belly button (cat pose). Repeat for several breaths.\n* Downward facing dog: From all fours, tuck your toes under and lift your hips towards the ceiling, forming an inverted V. Straighten your legs (without locking your knees) and arms. Press through your hands and slide your shoulder blades down your back. Gaze towards your feet. Hold for several breaths.\n* Forward fold: Walk your feet to meet your hands. Keep your feet hip-width apart, knees slightly bent, and grab opposite elbows. Relax your neck and shoulders. Hold for several breaths.\n* Half sun salutations: From forward fold, inhale to a flat back with hands under your knees. Exhale, fold forward. Inhale, sweep arms up towards the ceiling. Exhale, bring hands to heart and fold forward. Repeat several times.\n* High plank: From forward fold, place hands under shoulders and step feet back, coming into a push-up position. Engage your core and keep your body in a straight line from head to heels. Hold for 30 seconds.\n* Baby cobra: From plank, lower onto your belly. Place palms under shoulders and draw elbows close to your body. Inhale, press through the tops of your feet and lift your chest off the floor. Draw shoulders back and down, keeping your neck neutral. Hold for several breaths.\n* Sun salutation (modified): From forward fold, inhale to a flat back. Exhale, fold forward. Inhale, reach arms towards the ceiling. Exhale, bring hands to heart and fold forward. Inhale to a flat back. Exhale, step back to plank. Inhale. Exhale, lower onto your belly. Inhale to baby cobra. Exhale, come to all fours and then into downward facing dog. Repeat several times.\n**Workout**\n* Low lunge: Step your right foot forward and place your hands on either side of it. Lower your left knee to the ground, keeping your right knee over your right ankle. Look forward and hold for several breaths before switching sides.\n* Low lunge twist: From low lunge, plant your left hand on the floor and lift your right arm towards the ceiling, twisting your chest to the right. Look up at your right hand and breathe. Hold for several breaths before switching sides.\n* Low lunge with a backbend: From low lunge, bring your hands to your right thigh and straighten your spine. Gently arch your back, leading with your chest and keeping your shoulders back and down. Hold for several breaths before switching sides.\n* Seated forward fold: Sit with legs extended and bend forward from your hips, keeping your back straight. Hold for several breaths.\n* Seated twist: Sit with legs extended. Bend your right knee and place your right foot outside your left leg. Place your right hand behind you and hook your left elbow on the outside of your right knee. Twist to the right, keeping your spine straight. Hold for several breaths before switching sides.\n* Bridge pose: Lie on your back with knees bent and feet flat on the floor. Engage your glutes and lift your hips towards the ceiling, forming a straight line from your shoulders to your knees. Hold for several breaths.\n* Spinal twist: Lie on your back with knees bent and arms extended to the sides. Let your knees fall to the right side and turn your head to the left. Hold for several breaths before switching sides.\n**Cooldown:** Spend a few minutes relaxing in Savasana (corpse pose), lying flat on your back with arms by your sides and palms facing up.",
        "additional_information": "This yoga routine is designed for beginners but can be modified for different levels. If you're new to yoga, start with shorter holds and fewer repetitions. As you get stronger, you can gradually increase the duration and intensity. Remember to listen to your body and take breaks when needed.",
        "workout_title": "20-Minute Yoga for Beginners At-Home Routine",
        "url": "https://8fit.com/fitness/20-minute-yoga-for-beginners-at-home-routine/"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "1. **Child's Pose:**\n    - **Do it:** When you want a gentle stretch for your neck, spine, and hips.\n    - **Skip it:** If you have knee or ankle injuries, high blood pressure, or are pregnant.\n    - **Modify:** Rest your head on a cushion or block, use a rolled towel under your ankles.\n    - **Steps:**\n        1. Kneel on all fours, hands under shoulders, knees hip-width apart, big toes touching.\n        2. Exhale, lower buttocks towards heels, torso resting on thighs, head on the floor (or cushion).\n        3. Rest arms alongside thighs, palms up.\n        4. Relax spine and hips, take slow breaths.\n2. **Downward-Facing Dog:**\n    - **Do it:** To relieve back pain, strengthen arms, shoulders, and back.\n    - **Skip it:** If you have carpal tunnel syndrome, wrist problems, high blood pressure, or are in late pregnancy.\n    - **Modify:** Elbows on the ground, blocks under hands.\n    - **Steps:**\n        1. Start on all fours, hands shoulder-width apart, knees under hips, toes tucked.\n        2. Inhale, press into palms, raise knees off the ground.\n        3. Lift hips up and back, lengthening your spine.\n        4. Exhale, straighten legs as much as possible, heels towards the ground.\n        5. Lift shoulders away from ears, flatten shoulder blades, rotate upper arms down.\n        6. Inhale and exhale evenly, hold the pose.\n3. **Plank Pose:**\n    - **Do it:** To tone abs and build upper body strength.\n    - **Skip it:** If you have carpal tunnel syndrome or low back pain.\n    - **Modify:** Place knees on the floor.\n    - **Steps:**\n        1. Start in Downward-Facing Dog.\n        2. Inhale, shift forward to a straight line, shoulders over wrists, heels above balls of feet.\n        3. Exhale, press down through forearms and hands, gaze at the floor.\n        4. Breathe steadily, engage core, keep thighs lifted, hips high.\n4. **Four-Limbed Staff Pose:**\n    - **Do it:** To strengthen arms, wrists, and tone the abdomen.\n    - **Skip it:** If you have carpal tunnel syndrome, lower back pain, shoulder injury, or are pregnant.\n    - **Modify:** Keep knees on the floor.\n    - **Steps:**\n        1. From Plank, inhale, shift forward, sternum forward, shoulders slightly ahead of wrists.\n        2. Exhale, bend elbows straight back, lower body a few inches from the floor.\n        3. Hold the pose, breathe.\n5. **Cobra Pose:**\n    - **Do it:** To strengthen the back.\n    - **Skip it:** If you have arthritis in your spine or neck, low back injury, or carpal tunnel syndrome.\n    - **Modify:** Lift up a few inches, don't straighten arms.\n    - **Steps:**\n        1. Lie on your belly, forehead on the mat, toes pressing down.\n        2. Hands under shoulders, elbows close to torso, draw navel up.\n        3. Inhale, press feet and legs into the mat, straighten arms to lift head and chest.\n        4. Inhale, widen chest, hold.\n        5. Exhale, lower down.\n6. **Tree Pose:**\n    - **Do it:** To improve balance and posture.\n    - **Skip it:** If you have low blood pressure or balance issues.\n    - **Modify:** Place one hand on a wall for support.\n    - **Steps:**\n        1. Stand with feet together (or slightly apart).\n        2. Shift weight to right leg.\n        3. Raise left leg, clasp ankle, place sole of left foot on inner right thigh.\n        4. Press foot against thigh, thigh against foot, lift through standing leg, core, and chest.\n        5. Hold, breathe.\n        6. Lower left leg, repeat on the other side.\n7. **Triangle Pose:**\n    - **Do it:** To build leg strength and endurance.\n    - **Skip it:** If you have a headache or low blood pressure.\n    - **Modify:** Gaze downward if you have high blood pressure, look straight ahead if you have neck problems.\n    - **Steps:**\n        1. Wide stance, feet 3.5-4 feet apart.\n        2. Turn left foot slightly right, right foot out 90 degrees, front heel aligned with back arch.\n        3. Inhale, raise arms to sides, shoulder height.\n        4. Exhale, reach right arm to the right, lengthen torso over right leg, hips move left.\n        5. Right hand on shin, ankle, or floor outside right foot, keep torso sides long.\n        6. Stretch left arm toward ceiling, torso turns up, head neutral or turned left.\n        7. Hold, breathe, switch sides.\n8. **Seated Half-Spinal Twist Pose:**\n    - **Do it:** To release tight muscles in shoulders and back.\n    - **Skip it:** If you have a back injury.\n    - **Modify:** Keep right leg straight if bending the knee is uncomfortable.\n    - **Steps:**\n        1. Sit with hands on floor behind you, legs straight.\n        2. Bend right knee, right foot outside left knee.\n        3. Inhale, lengthen torso, exhale, twist right, hug knee or place left arm outside right leg.\n        4. Breathe, lift through sternum on inhale, twist more on exhale.\n        5. Release, switch sides.\n9. **Bridge Pose:**\n    - **Do it:** To open the upper chest, build back and hamstring strength.\n    - **Skip it:** If you have a neck injury.\n    - **Modify:** Block between thighs, block under pelvis.\n    - **Steps:**\n        1. Lie on your back, knees bent, feet close to torso, arms alongside hips, palms down, inhale.\n        2. Exhale, press feet and palms into floor, lift hips.\n        3. Clasp hands under if possible, extend arms.\n        4. Lift until thighs are parallel to the floor, lengthen tailbone, lift pubis.\n        5. Lift chin slightly, firm shoulder blades, press sternum towards chin.\n        6. Hold, breathe, release.\n10. **Corpse Pose:**\n    - **Do it:** Always.\n    - **Skip it:** If you don't want a moment of peace.\n    - **Modify:** Blanket under head, blanket under knees.\n    - **Steps:**\n        1. Lie on your back.\n        2. Straighten legs, feet can turn out slightly.\n        3. Arms a few inches from body, backs of hands on floor, shoulder blades resting evenly.\n        4. Release weight, relax muscles, breathe normally.",
        "additional_information": "This sequence of 10 yoga poses provides a complete yoga workout. Remember to move slowly, breathe deeply, and pause if needed.  Modifications and variations are provided for each pose to accommodate different needs and skill levels.",
        "workout_title": "10 Essential Yoga Poses for a Complete Workout",
        "url": "https://www.nytimes.com/article/beginner-yoga.html"
    },
    {
        "contains_complete_workout_plan": true,
        "workout_plan": "Week One: \nStanding Forward Fold: Stand with feet hips-width toes pointing straight forward or slightly pigeon-toed. Place hands on hips and on the exhale hinge forward at the hips. Rest your hands on the ground as you lower into a forward fold. If you cannot reach the ground just go as far down as youre able. Keep your heels on the ground and roll your weight toward the balls of your feet for an extra stretch in your hamstrings. Hold for 30 to 60 seconds before releasing.\nHigh Plank Position: Start on all fours with your wrists stacked under your shoulders and your knees under your hips. Push into the ground with your palms. Step one foot back at a time into the top of a push-up position. Brace your midline so that your hips are in line with your shoulders. \nChaturanga to Upward Facing Dog: Keep your midline braced and arms strong from the high plank position. Shift forward onto the tips of your toes. Keep your elbows glued to your ribcage and bend them back to lower your chest and hips toward the flow in one motion. Release your toes at the bottom of the push-up so that the tops of your feet are kissing the mat. Keep your hips down and feet and legs active and press your palms into the mat. Straighten your arms and pull your chest through your arms until you feel a gentle stretch in your lower back. Release your chest and flip your toes over. Exhale as you press your palms into the mat and straighten your arms back into a high plank position.\nDownward-Facing Dog: Drop to your knees from the high plank position so that youre in a table-top position. Press into your hands lift your knees off the floor and press your hips up and back toward the ceiling. Keep your hips high shift weight onto your feet and lower your heels as close to the floor as possible. Hold this position keeping your shoulders drawn away from your ears. \nPigeon Pose: Release your left foot from the downward-facing dog pose and lift your leg up toward the ceiling. Sweep it down toward the ground so that your left shin rests just behind both hands. Keep your right leg fully extended behind your body and lower your bum toward the floor. Hold this position gazing toward the floor in between your hands keeping your spine lengthened and pelvis centered. \nWeek Two: Repeat Week One's flow and add Warrior Two: Lift your left leg up behind you from the downward-facing dog position. Look forward and shift your weight onto your hands. Tuck your left knee into your chest before reaching the left foot down between your arms planting the foot between your hands. Drop your right foot down with your toes turned out and away from your body 90 degrees. Release your hands from the ground and use your midline to pull your chest up. Bring your hands to your hips and relax your shoulders. Extend your arms out to the sides with your palms down. Deepen the bend in your left knee and gaze out over your hand. Hold the pose on this side for as long as it feels good. Repeat flow a second time, switching the lead leg for Warrior Two. \nWeek Three: Repeat Week Two's flow and add Warrior Three in between Downward-Facing Dog and Warrior Two: Lift your left leg into the air from the downward dog position. Bring your left knee to your nose before placing your left foot in between your hands. Pivot the back heel down onto the mat so that your toes are facing up. Engage your midline to rise up while bending into your front leg. Center your hips to face forward which is known as warrior one. Keep your midline tight and ground down through your front left foot and slowly lift your back right leg out behind you. Bring your arms down along your body with your fingertips pointing back while lifting your back left leg as high as you can behind you. Hinge at your hips and continue bending until theres a straight line from head to heel. Hold as long as possible before returning your back foot to the ground and re-taking warrior one. From here you will cartwheel your hands down into a high plank then repeat the exact same sequence. The only difference is that you will switch leg leads for warrior three and warrior two. \nWeek Four: Repeat Week Three's flow and add Half Moon at the end of each flow: Get into a warrior three position on your left leg. Bring your hands from behind your back toward the ground or block. Keep your left leg and fingers on the ground. Rotate toward the right opening your right hip toward the ceiling until it stacks on top of the left hip. Brace your midline then extend your right arm straight up and look up toward your right fingers. Keep your left leg straight flex your left foot by pulling your toes toward your head. Hold here before returning to the warrior three pose.",
        "additional_information": "This is a 30 day yoga challenge designed by Ashley Galvin, a yoga instructor with Alo Moves, in partnership with Shape. This challenge includes just three beginner yoga routines per week. Some people might do it on their rest days. Others might do it as part of their warm-ups or cool-downs. There are no rules with yoga. What’s most important is you make it work in your life so that it can become sustainable. In general, people should try to implement yoga into their routine three days a week to reap the physical and strength benefits. ",
        "workout_title": "30-Day Beginner-Friendly Yoga Challenge",
        "url": "https://www.shape.com/beginner-yoga-routine-challenge-8350904"
    }
]